#include <stdio.h>
//:read /home/peter/mao/04_BlurImage.cpp
//--------------------------------------【程序說明】-------------------------------------------
//		程序說明：《OpenCV3程式設計入門》OpenCV2版書本配套範例程序04
//		程序描述：使用blur函數進行基于均值濾波的圖像模糊操作
//		開發測試所用操作系統： Windows 7 64bit
//		開發測試所用IDE版本：Visual Studio 2010
//		開發測試所用OpenCV版本：	2.4.9
//		2014年03月 Created by @淺墨_毛星云
//		2014年11月 Revised by @淺墨_毛星云
//------------------------------------------------------------------------------------------------


//---------------------------------【頭文件、命名空間包含部分】---------------------------
//		描述：包含程序所使用的頭文件和命名空間
//-----------------------------------------------------------------------------------------------
#include "opencv2/highgui/highgui.hpp" 
#include "opencv2/imgproc/imgproc.hpp" 
using namespace cv; 

//-----------------------------------【main( )函數】--------------------------------------------
//		描述：控制臺應用程序的入口函數，我們的程序從這里開始
//-----------------------------------------------------------------------------------------------
int main( )
{ 
	//【1】載入原始圖
	Mat srcImage=imread("/home/peter/opencv-2.4.11/samples/cpp/mao/1.jpg"); 

	//【2】顯示原始圖
	imshow( "均值濾波【原圖】", srcImage ); 

	//【3】進行均值濾波操作
	Mat dstImage; 
	blur( srcImage, dstImage, Size(7, 7)); 

	//【4】顯示效果圖
	imshow( "均值濾波【效果圖】" ,dstImage ); 
	moveWindow( "均值濾波【效果圖】" ,100,100 ); 

	waitKey( 0 );     
} 
