
#include <stdio.h>


//-----------------------------------【頭文件包含部分】---------------------------------------
//	描述：包含程序所依賴的頭文件
//---------------------------------------------------------------------------------------------- 
#include "opencv2/core/core.hpp" 
#include "opencv2/highgui/highgui.hpp" 
#include "opencv2/imgproc/imgproc.hpp" 

//-----------------------------------【命名空間宣告部分】---------------------------------------
//	描述：包含程序所使用的命名空間
//-----------------------------------------------------------------------------------------------  
using namespace cv; 

//-----------------------------------【main( )函數】--------------------------------------------
//	描述：控制臺應用程序的入口函數，我們的程序從這里開始
//-----------------------------------------------------------------------------------------------
int main( )
{ 
	// 載入原圖
	Mat image=imread("/home/peter/opencv-2.4.11/samples/cpp/mao/1.jpg"); 

	//建立視窗
	namedWindow( "雙邊濾波【原圖】" ); 
	namedWindow( "雙邊濾波【效果圖】"); 

	//顯示原圖
	imshow( "雙邊濾波【原圖】", image ); 

	//進行雙邊濾波操作
	Mat out; 
	bilateralFilter ( image, out, 25, 25*2, 25/2 ); 

	//顯示效果圖
	imshow( "雙邊濾波【效果圖】" ,out ); 

	waitKey( 0 );     
} 
